app/controllers/user_controller.rb

SELECT "logs".* FROM "logs" WHERE "logs"."user_id" = ?  ORDER BY "logs"."data_created" ASC  [["user_id", 1]]
---
	def index
		@log = Log.where(user_id: current_user.id).order("data_created desc")

SELECT "users".* FROM "users" WHERE (NOT (id = 1))
---
	def transfer
		@users = User.all.where.not('id = ?', current_user.id)